import "../styles/Sidebar.css"

export default function Sidebar() {

    const categories = [
        "Ноутбуки та комп'ютери",
        "Смартфони, ТВ і електроніка",
        "Товари для геймерів",
        "Побутова техніка",
        "Товари для дому",
        "Авто і мото",
        "Інструменти та обладнання",
        "Сантехніка та ремонт",
        "Дача, сад і город",
        "Спорт і захоплення",
        "Одяг, взуття та прикраси",
        "Краса та здоров'я",
        "Дитячі товари",
        "Зоотовар",
        "Офіс, школа, книги",
        "Алкогольні напої та продукти",
        "Побутова хімія",
        "Енергонезалежність",
        "Подарунки та сувеніри",
        "(%) Великодні знижки до 45%",
        "Всі акції"
    ]

    return (
        <div className="sidebar">

            {categories.map((cat, index) => (
                <ul key={index} className="ul-list">
                    <li className="li-list">{cat}</li>
                </ul>
            ))}

        </div>
    )
}